Документация/cfe_ZUP/InformationRegisters/КАБНастройкиПодключенияКRebbitMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КАБНастройкиПодключенияКRebbitMQ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВиртуальныйХост</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочкаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлючМаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяОчереди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Включен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Документация/cfe_ZUP/CommonModules/RebbitMQСервер/Ext/Module.bsl
#Область Настройки

Функция ПолучитьНастройкиПодключенияИзРегистра(ДопУсловие = "") Экспорт  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	RMQ.Адрес КАК Адрес,
		|	RMQ.Порт КАК Порт,
		|	RMQ.Логин КАК Логин,
		|	RMQ.Пароль КАК Пароль,
		|	RMQ.ВиртуальныйХост КАК ВиртуальныйХост,
		|	RMQ.ТочкаОбмена КАК ТочкаОбмена,
		|	RMQ.ИмяОчереди КАК ИмяОчереди,
		|	RMQ.Включен КАК Включен,
		|	RMQ.Таймаут КАК Таймаут,
		|	RMQ.КлючМаршрута КАК КлючМаршрута
		|ИЗ
		|	РегистрСведений.КАБНастройкиПодключенияКRebbitMQ КАК RMQ
		|ГДЕ
		|	RMQ.Включен
		|	И &ДопУсловие";
	
	Запрос.УстановитьПараметр("ДопУсловие", Истина);
	
	Если ЗначениеЗаполнено(ДопУсловие) Тогда
	    Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДопУсловие", "RMQ.Описание = &Описание");
		Запрос.УстановитьПараметр("Описание", Строка(СокрЛП(ДопУсловие)));
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Настройки = Новый Структура("Адрес,Порт,Логин,Пароль,ВиртуальныйХост,ТочкаОбмена,ИмяОчереди,Таймаут,КлючМаршрута");
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Настройки, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат Настройки;
	
КонецФункции

Функция ПолучитьНастройкиПодключения(Адрес, Порт, Логин, Пароль, ВиртуальныйХост,ТочкаОбмена, ИмяОчереди, Таймаут) Экспорт  
	
	Возврат Новый Структура("Адрес,Порт,Логин,Пароль,ВиртуальныйХост,ТочкаОбмена,ИмяОчереди,Таймаут",
			Адрес, Порт, Логин, Пароль, ВиртуальныйХост, ТочкаОбмена, ИмяОчереди, Таймаут);
КонецФункции

#КонецОбласти

#Область Компонента 

Функция ПолучитьКомпоненту() Экспорт 

	КлиентКомпоненты = Неопределено;
	Если Не ИнициализироватьКомпоненту(КлиентКомпоненты) Тогда
		
		РезультатПодключения = ПодключитьВнешнююКомпоненту("ОбщийМакет.PinkRabbitMQ", "BITERP", ТипВнешнейКомпоненты.Native);
		
		Если РезультатПодключения Тогда
			ИнициализироватьКомпоненту(КлиентКомпоненты);
		КонецЕсли;    	
	КонецЕсли;
	
	Возврат КлиентКомпоненты;
	
КонецФункции

Функция ИнициализироватьКомпоненту(Компонента)
	
	Попытка
		Компонента  = Новый("AddIn.BITERP.PinkRabbitMQ");
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти
